[
  {
    "id": 1,
    "rating": 4.8,
    "price": 9.99,
    "genre": "Fantasy",
    "coverImage": "harry_potter1",
    "publishedDate": "26-06-1997",
    "summary": "Eleven-year-old Harry Potter discovers that he is a wizard on his birthday and receives an invitation to Hogwarts School of Witchcraft and Wizardry. At Hogwarts, he makes friends, learns magic, and uncovers the mystery surrounding his parents' death. As he faces challenges from dark forces and uncovers secrets of the wizarding world, Harry begins his journey as a hero destined to confront the dark wizard Voldemort.",
    "author": "J.K. Rowling",
    "title": "Harry Potter and the Sorcerer's Stone"
  },
  {
    "id": 2,
    "author": "J.K. Rowling",
    "genre": "Fantasy",
    "rating": 4.7,
    "coverImage": "harry_potter2",
    "price": 10.99,
    "title": "Harry Potter and the Chamber of Secrets",
    "publishedDate": "02-07-1998",
    "summary": "Harry returns for his second year at Hogwarts and discovers that a dark force is petrifying students. With the help of his friends Ron and Hermione, he uncovers secrets about the Chamber of Secrets. Facing danger and mystery, Harry grows braver and wiser as a young wizard."
  },
  {
    "id": 3,
    "author": "J.R.R. Tolkien",
    "genre": "Fantasy",
    "rating": 4.7,
    "coverImage": "hobbit",
    "price": 12.99,
    "title": "The Hobbit",
    "publishedDate": "21-09-1937",
    "summary": "Bilbo Baggins, a quiet hobbit, is swept into an epic quest by the wizard Gandalf and a company of dwarves. They seek to reclaim the dwarves' homeland from the dragon Smaug. Bilbo encounters trolls, goblins, and discovers courage and cleverness he never knew he had."
  },
  {
    "id": 4,
    "author": "J.R.R. Tolkien",
    "genre": "Fantasy",
    "rating": 4.9,
    "coverImage": "lotr1",
    "price": 15.99,
    "title": "The Fellowship of the Ring",
    "publishedDate": "29-07-1954",
    "summary": "Frodo Baggins inherits the One Ring, a powerful artifact that could enslave Middle-earth. He begins a perilous journey to destroy it, forming a fellowship of diverse heroes. They face treacherous lands, dark creatures, and the looming threat of Sauron."
  },
  {
    "id": 5,
    "author": "J.R.R. Tolkien",
    "genre": "Fantasy",
    "rating": 4.9,
    "coverImage": "lotr2",
    "price": 15.99,
    "title": "The Two Towers",
    "publishedDate": "11-11-1954",
    "summary": "The fellowship is broken, but the quest continues. Frodo and Sam journey to Mordor, guided by the enigmatic Gollum. Meanwhile, Aragorn, Legolas, and Gimli fight to save Middle-earth from Sauron's armies."
  },
  {
    "id": 6,
    "publishedDate": "20-10-1955",
    "genre": "Fantasy",
    "author": "J.R.R. Tolkien",
    "summary": "The final confrontation with Sauron unfolds as Frodo approaches Mount Doom. Allies unite to fight in epic battles, and the fate of Middle-earth hangs in the balance. Sacrifice, courage, and friendship shape the conclusion of this legendary saga.",
    "rating": 5,
    "title": "The Return of the King",
    "price": 16.99,
    "coverImage": "lotr3"
  },
  {
    "id": 7,
    "genre": "Dystopian",
    "publishedDate": "08-06-1949",
    "author": "George Orwell",
    "summary": "In a totalitarian society ruled by Big Brother, Winston Smith struggles for freedom and truth. Surveillance, propaganda, and oppression dominate daily life. Winston risks everything to rebel against the system, uncovering the harsh reality of a controlled world.",
    "rating": 4.6,
    "title": "1984",
    "price": 8.99,
    "coverImage": "1984"
  },
  {
    "id": 8,
    "genre": "Dystopian",
    "publishedDate": "17-08-1945",
    "author": "George Orwell",
    "summary": "The animals of Manor Farm revolt against their human farmer, seeking equality and justice. However, power corrupts, and the pigs begin to resemble the oppressive humans they overthrew. A sharp allegory on society, politics, and the nature of power.",
    "rating": 4.5,
    "title": "Animal Farm",
    "price": 7.99,
    "coverImage": "animal_farm"
  },
  {
    "id": 9,
    "genre": "Dystopian",
    "publishedDate": "01-01-1932",
    "author": "Aldous Huxley",
    "summary": "A technologically advanced society controls citizens through conditioning and pleasure. Individuality and emotion are suppressed in favor of social stability. One man begins to question the system, seeking truth and authentic experience.",
    "rating": 4.3,
    "title": "Brave New World",
    "price": 9.49,
    "coverImage": "brave_new_world"
  },
  {
    "id": 10,
    "genre": "Classic",
    "publishedDate": "01-01-1869",
    "author": "Leo Tolstoy",
    "summary": "Set against the backdrop of Napoleonic wars, the novel follows the lives of Russian aristocracy. Love, ambition, and fate intertwine as characters navigate personal and national crises. Tolstoy explores philosophy, morality, and the human condition with unparalleled depth.",
    "rating": 4.5,
    "title": "War and Peace",
    "price": 12.99,
    "coverImage": "war_and_peace"
  },
  {
    "id": 11,
    "genre": "Classic",
    "publishedDate": "01-01-1877",
    "author": "Leo Tolstoy",
    "summary": "The tragic love story of Anna Karenina unfolds amid Russian high society. Passion, betrayal, and social pressures shape her fate. Tolstoy contrasts Anna's life with parallel narratives of family, morality, and societal expectation.",
    "rating": 4.6,
    "title": "Anna Karenina",
    "price": 11.99,
    "coverImage": "anna_karenina"
  },
  {
    "id": 12,
    "coverImage": "great_expectations",
    "publishedDate": "01-08-1861",
    "price": 9.99,
    "genre": "Classic",
    "summary": "Pip, an orphan, dreams of rising above his humble beginnings. Through encounters with the eccentric Miss Havisham and the mysterious Magwitch, Pip learns life lessons. Dickens weaves themes of ambition, love, and social class into a compelling narrative.",
    "rating": 4.4,
    "title": "Great Expectations",
    "author": "Charles Dickens"
  },
  {
    "id": 13,
    "coverImage": "gatsby",
    "publishedDate": "10-04-1925",
    "price": 6.99,
    "genre": "Classic",
    "summary": "Jay Gatsby, a mysterious millionaire, throws lavish parties in hopes of reuniting with his lost love, Daisy Buchanan. Set during the roaring twenties, the novel explores themes of wealth, obsession, and the American Dream. Gatsby's journey reveals the emptiness behind glamour and the consequences of longing for the unattainable.",
    "rating": 4.4,
    "title": "The Great Gatsby",
    "author": "F. Scott Fitzgerald"
  },
  {
    "id": 14,
    "coverImage": "mockingbird",
    "publishedDate": "11-07-1960",
    "price": 9.49,
    "genre": "Classic",
    "summary": "Scout Finch recounts her childhood in a racially divided Southern town. Her father, Atticus, defends a black man accused of rape, teaching courage and morality. The story explores justice, empathy, and the innocence of youth amidst prejudice.",
    "rating": 4.9,
    "title": "To Kill a Mockingbird",
    "author": "Harper Lee"
  },
  {
    "id": 15,
    "coverImage": "mobydick",
    "publishedDate": "18-10-1851",
    "price": 7.99,
    "genre": "Classic",
    "summary": "Captain Ahab obsessively hunts the white whale, Moby Dick, seeking revenge for past injuries. The crew faces perilous seas, moral dilemmas, and existential questions. A tale of obsession, fate, and the struggle against nature's immensity.",
    "rating": 4.1,
    "title": "Moby-Dick",
    "author": "Herman Melville"
  },
  {
    "id": 16,
    "coverImage": "pride_prejudice",
    "publishedDate": "28-01-1813",
    "price": 8.49,
    "genre": "Classic",
    "summary": "Elizabeth Bennet navigates society, manners, and romantic entanglements. Her wit and intelligence challenge societal norms while she falls in love with the proud Mr. Darcy. A timeless exploration of love, class, and personal growth.",
    "rating": 4.6,
    "title": "Pride and Prejudice",
    "author": "Jane Austen"
  },
  {
    "id": 17,
    "coverImage": "sense_sensibility",
    "publishedDate": "30-10-1811",
    "price": 7.99,
    "genre": "Romance",
    "summary": "The Dashwood sisters, Elinor and Marianne, experience love, heartbreak, and societal pressures after their father's death. Their contrasting personalities navigate friendship, romance, and family obligations. A delicate balance of emotion, reason, and societal expectations is explored.",
    "rating": 4.5,
    "title": "Sense and Sensibility",
    "author": "Jane Austen"
  },
  {
    "id": 18,
    "coverImage": "notebook",
    "publishedDate": "01-10-1996",
    "price": 9.49,
    "genre": "Romance",
    "summary": "Noah Calhoun and Allie Nelson share a passionate summer romance. Separated by circumstance, they are reunited decades later, proving the endurance of true love. A heartfelt story of memory, devotion, and second chances.",
    "rating": 4.7,
    "title": "The Notebook",
    "author": "Nicholas Sparks"
  },
  {
    "id": 19,
    "coverImage": "me_before_you",
    "publishedDate": "05-01-2012",
    "price": 10.99,
    "genre": "Romance",
    "summary": "Louisa Clark becomes a caregiver for the wealthy but paralyzed Will Traynor. Their unlikely relationship challenges both of them to embrace life, love, and difficult choices. A poignant story about courage, compassion, and heartbreak.",
    "rating": 4.6,
    "title": "Me Before You",
    "author": "Jojo Moyes"
  },
  {
    "id": 20,
    "coverImage": "time_travelers_wife",
    "publishedDate": "05-03-2003",
    "price": 10.49,
    "genre": "Romance",
    "summary": "Henry has a rare genetic disorder that causes him to time travel unpredictably. His wife Clare copes with his sudden disappearances while building a life of love and patience. A complex and emotional exploration of destiny, love, and the passage of time.",
    "rating": 4.5,
    "title": "The Time Traveler's Wife",
    "author": "Audrey Niffenegger"
  },
  {
    "id": 21,
    "coverImage": "emma",
    "publishedDate": "23-12-1815",
    "price": 7.49,
    "genre": "Romance",
    "summary": "Emma Woodhouse is a confident young woman who enjoys matchmaking for her friends. Her attempts at arranging love lead to humorous mistakes and personal growth. Through self-awareness and understanding, Emma discovers true love and friendship.",
    "rating": 4.4,
    "title": "Emma",
    "author": "Jane Austen"
  },
  {
    "id": 22,
    "genre": "Romance",
    "publishedDate": "06-08-1991",
    "author": "Diana Gabaldon",
    "summary": "Nurse Claire Randall is transported from 1945 to 18th-century Scotland. Caught between two worlds, she faces political intrigue, war, and forbidden love. Her journey blends romance, adventure, and historical drama.",
    "rating": 4.7,
    "title": "Outlander",
    "price": 10.99,
    "coverImage": "outlander"
  },
  {
    "id": 23,
    "genre": "Thriller",
    "publishedDate": "24-05-2012",
    "author": "Gillian Flynn",
    "summary": "Nick and Amy's seemingly perfect marriage shatters when Amy disappears. Twists, lies, and secrets unfold as the investigation progresses. A psychological thriller exploring deception, media influence, and human darkness.",
    "rating": 4.3,
    "title": "Gone Girl",
    "price": 11.49,
    "coverImage": "gone_girl"
  },
  {
    "id": 24,
    "genre": "Thriller",
    "publishedDate": "01-08-2005",
    "author": "Stieg Larsson",
    "summary": "Journalist Mikael Blomkvist teams with hacker Lisbeth Salander to investigate a decades-old disappearance. They uncover corruption, murder, and family secrets. A gripping mystery with complex characters and dark intrigue.",
    "rating": 4.5,
    "title": "The Girl with the Dragon Tattoo",
    "price": 12.99,
    "coverImage": "dragon_tattoo"
  },
  {
    "id": 25,
    "genre": "Thriller",
    "publishedDate": "01-02-2003",
    "author": "Dennis Lehane",
    "summary": "US Marshal Teddy Daniels investigates a missing patient case on Shutter Island. As the investigation unfolds, psychological tension escalates and hidden truths emerge. A suspenseful story with shocking twists and an unreliable perspective.",
    "rating": 4.2,
    "title": "Shutter Island",
    "price": 10.99,
    "coverImage": "shutter_island"
  },
  {
    "id": 26,
    "genre": "Thriller",
    "publishedDate": "18-03-2003",
    "author": "Dan Brown",
    "summary": "Symbologist Robert Langdon uncovers a series of mysterious codes hidden in famous artworks. As he races across Europe, he uncovers a secret society and a shocking conspiracy. A fast-paced thriller blending history, religion, and suspense.",
    "rating": 4.2,
    "title": "The Da Vinci Code",
    "price": 11.99,
    "coverImage": "da_vinci_code"
  },
  {
    "id": 27,
    "genre": "Thriller",
    "publishedDate": "01-05-2000",
    "author": "Dan Brown",
    "summary": "Langdon investigates the mysterious murder of a physicist and uncovers a deadly conspiracy involving the Illuminati. The story unfolds through secret passages and hidden clues in the Vatican. A suspenseful tale of danger, intrigue, and intellectual challenge.",
    "rating": 4.1,
    "title": "Angels & Demons",
    "price": 10.99,
    "coverImage": "angels_demons"
  },
  {
    "id": 28,
    "genre": "Thriller",
    "publishedDate": "14-05-2013",
    "author": "Dan Brown",
    "summary": "Langdon awakens in an Italian hospital with no memory of recent events. He discovers a trail of clues related to Dante’s Inferno and a global bio-threat. A pulse-pounding journey across Florence, Venice, and Istanbul to prevent catastrophe.",
    "rating": 4,
    "title": "Inferno",
    "price": 12.49,
    "coverImage": "inferno"
  },
  {
    "id": 29,
    "genre": "Historical Fiction",
    "publishedDate": "01-09-1989",
    "author": "Ken Follett",
    "summary": "Set in 12th-century England, the story follows the construction of a cathedral in Kingsbridge. Characters navigate love, betrayal, and ambition amidst political turmoil. A sprawling epic of human resilience, power, and faith.",
    "rating": 4.7,
    "title": "The Pillars of the Earth",
    "price": 13.99,
    "coverImage": "pillars_earth"
  },
  {
    "id": 30,
    "genre": "Historical Fiction",
    "publishedDate": "01-10-2007",
    "author": "Ken Follett",
    "summary": "The descendants of Kingsbridge face war, plague, and personal intrigue two centuries later. The novel explores love, betrayal, and survival against a turbulent historical backdrop. An immersive continuation of Follett's epic saga.",
    "rating": 4.6,
    "title": "World Without End",
    "price": 14.49,
    "coverImage": "world_without_end"
  },
  {
    "id": 31,
    "genre": "Historical Fiction",
    "publishedDate": "14-03-2005",
    "author": "Markus Zusak",
    "summary": "Liesel Meminger, a young girl in Nazi Germany, discovers the power of words and books. She steals books to survive and to resist oppression, forging bonds with family and friends. A touching story of humanity, courage, and the impact of literature.",
    "rating": 4.8,
    "title": "The Book Thief",
    "price": 11.99,
    "coverImage": "book_thief"
  }
]
